package main

import (
	"fmt"
)

// Функція для пошуку дублікатів у масиві
func знайтиДублікати(масив []int) []int {
	дублікати := []int{}
	кількістьЕлементів := make(map[int]int)

	for _, значення := range масив {
		кількістьЕлементів[значення]++
		if кількістьЕлементів[значення] == 2 {
			дублікати = append(дублікати, значення)
		}
	}
	return дублікати
}

func main() {
	масив := []int{1, 2, 3, 2, 4, 5, 3, 6}
	fmt.Println("Дублікатні елементи:", знайтиДублікати(масив))
}
